// Определить количество цифр в числе. Сделать подпрограмму.
int N = Convert.ToInt32(Console.ReadLine());
int count = 0;
while (N > 0) {
    N = N / 10;
    count++;
}
System.Console.WriteLine(count);